{
  "person": {
    "id": 1,
    "name": "Torres, Juan Carlos",
    "firstName": "Juan",
    "secondName": "Carlos",
    "lastName": "Torres",
    "image": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
    "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
    "position": "Programador Full Stack Junior",
    "about": "Además de 3 años como autodidacta aprendiendo los lenguajes HTML, CSS, JS, PHP y MYSQL, se agregan mis estudios en el curso #ArgentinaPrograma, particulares de Inglés y, en un futuro, Licenciatura en Ciencias de la Computación en la UBA.<br> Tengo una gran afinidad con los programas computacionales, obteniendo grandes resultados en poco tiempo de uso, entre ellos también se incluyen Photoshop, Office y demás ramas algo mas alejadas de la programación.<br> Me comprometo siempre al 100% con mí trabajo, dándole importancia por sobre todo y enfocándome totalmente en él para resolver los desafíos que se me pongan por delante.<br> Siempre creando un buen ambiente laboral, soy una persona con grandes capacidades sociales y buen manejo del lenguaje.<br> Si buscas a alguien para un trabajo bien hecho, responsable, y eficaz, soy la persona indicada.",
    "resume": "4 Años de experiencia autodidacta desarrollando sitios web completos.<br>Más de 5 años de experiencia autodidacta en programación web.<br>Desarrollo Front End dinámico y Back End seguro.<br>Gran afinidad para aprender nuevos lenguajes, programas y herramientas.<br>Años de experiencia creando y editando logos, imágenes y contenido audiovisual.<br>"
  },
  "studies": [{
      "id": 1,
      "name": "Secundario Completo",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "by": "E.E.S.N°1 Juan Bautista Barnech",
      "title": "Bachiller en Cs. Naturales",
      "start": "2015",
      "end": "2020",
      "about": "Luego de estudiar el primario en las escuelas N°1 y N°35 de Luján, cursé todo el secundario en la institución nombrada en honor a Juan Bautista Barnech, decidiéndome por la orientación de las ciencias naturales y dándolo por finalizado durante la pandemia de Covid-19."
    },
    {
      "id": 2,
      "name": "Radio El Sótano",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "by": "E.E.S.N°1",
      "title": "Locutor y Productor",
      "start": "2017",
      "end": "2020",
      "about": "Durante mís estudios en la E.E.S.N°1, me uní al taller de radio, comenzando como operador, luego de mí primer año comencé a locutar y producir rutinas para diferentes programas.<br>Consiguiendo mí propio programa de divulgación científica, se me otorgaron distintos reconocimientos durante los años, como 'Segundo mejor programa' o por lealtad."
    },
    {
      "id": 3,
      "name": "#ArgentinaPrograma",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "by": "I.N.T.I",
      "title": "Programador Full Stack Junior",
      "start": "2022",
      "end": "2023",
      "about": "En cuestión de pocas semanas, finalicé la primer etapa del curso #SeProgramar, completando todas las actividades dadas y aprobando el examen final sin errores.<br>En el curso #YoProgramo se me dieron todas las herramientas necesarias para convertirme en un desarrollador Full Stack Junior, dejando como prueba de mí aprendizaje éste Portfolio y las tecnologías que se usan en él."
    }
  ],
  "abilities": [{
    "id": 1,
    "name": "HTML",
    "skill": "95%"
    },
    {
    "id": 2,
    "name": "CSS",
    "skill": "80%"
    },
    {
    "id": 3,
    "name": "JavaScript",
    "skill": "40%"
    },
    {
    "id": 4,
    "name": "MySQL",
    "skill": "80%"
    },
    {
    "id": 5,
    "name": "TypeScript",
    "skill": "50%"
    },
    {
    "id": 6,
    "name": "Angular",
    "skill": "80%"
    },
    {
    "id": 7,
    "name": "Java",
    "skill": "20%"
    },
    {
    "id": 8,
    "name": "Inglés",
    "skill": "95%"
    },
    {
    "id": 9,
    "name": "Edición",
    "skill": "50%"
    }
  ],
  "jobs": [{
      "id": 1,
      "name": "Mostaza",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "time": "8 Meses",
      "start": "Julio 2021",
      "end": "Febrero 2022",
      "position": "Cajero",
      "about": "Iniciando como Cajero, pasando por todos los puestos:<br>Cafetería, Armado, Zona, Cocina, Producción, Limpieza, Carga y Descarga.<br>Durante mís 8 meses hice mí trabajo de la manera mas limpia, rápida y eficaz posible, creando un gran ambiente laboral. Finalmente, a causa de la carga horaria, decidí renunciar para poder estudiar mas a fondo mís habilidades de programación."
    }
  ],
  "proyects": [{
      "id": 1,
      "name": "Mí Portfolio",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "status": "Finalizado",
      "start": "2022",
      "end": "2023",
      "type": "SPA Dinámico",
      "url": "#",
      "about": "Durante mí curso en Argentina Programa, se me dió el trabajo de crear mí propio portfolio personalizado y a gusto, completamente desde 0 y utilizando las siguientes herramientas:<br>HTML, CSS, JavaScript, TypeScript, Angular, Java, MySQL, VSC y Git/GitHub.<br>Con todos estos elementos, además de lo básico, también he incorporado un CRUD, con el fin de poder editar completamente a voluntad las diferentes secciones del sitio con el estilo OnePageApplication.<br>Se há creado un sistema de usuarios también, en el cual dependiendo el alcance del rango, se podrá interactuar mejor con la página en cuestión."
    },
    {
      "id": 2,
      "name": "Eternal Cooldown",
      "logo": "https://cdn-icons-png.flaticon.com/512/85/85488.png",
      "status": "En Proceso",
      "start": "2019",
      "end": "?",
      "type": "Red Social",
      "url": "#",
      "about": "Este proyecto fue mí primer acercamiento a la programación a fondo. Comenzando como un emprendimiento, desde el inicio y con ayuda de un compañero que, durante la pandemia, decidió dar un paso al costado, programé un sitio web estilo MultiplePageApplication utilizando las siguientes tecnologías:<br>HTML, CSS, JavaScript, PHP, MySQL, AJAX, Brackets.<br>Aunque por ahora congelado, debido a la necesidad de aprender nuevas tecnologías, sigue siendo un trabajo en proceso y en el que pueden verse mís avances con ciertos lenguajes, comenzando sin nada de conocimiento en PHP, AJAX, JavaScript y MySQL y finalizando con el conocimiento necesario para poder crear mís propios programas en cuestión de pocos meses."
    }
  ]
}
